// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = +prompt('Введіть хвилину');
if (time > 0 && time < 15 || time === 15 || time === 0) {
    console.log('Це перша частина години')
} else if(time > 15 && time < 30 || time === 30) {
    console.log('Це друга частина години')
} else if(time > 30 && time < 45 || time === 45) {
    console.log('Це третя частина години')
} else if(time > 45 && time < 59 || time === 59) {
    console.log('Це четверта частина години')
} else {
    console.log('Виходить за межі')
}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = +prompt('Введіть число місяця');
if (day>=1 && day<=10){
    console.log('Перша декада')
} else if(day>=11 && day<=20){
    console.log('Друга декада')
} else if(day>=21 && day<=31){
    console.log('Третя декада')
} else {
    console.log('Неправильно введені дані')
}

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = confirm('Бажаєте, щоб сайт надсилав Вам повідомлення?)))');
if(test === true){
    console.log('Вірно')
} else {
    console.log('Неправильно')
}
let test2 = confirm('Ви впевнені?)))') ? 'Вірно' : 'Неправильно';
console.log(test2);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = +prompt('Введіть число 1, 0, -3');
if (a !== 0) {
    console.log('Вірно')
} else {
    console.log('Невірно')
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

let dayWork = +prompt('Введіть день тижня');
switch (dayWork) {
    case 1:
        console.log('Понеділок, розклад: 1.Проектне бюджетування та фінансове планування 2.Прийняття проектних рішень');
        break;
    case 2:
        console.log('Вівторок, розклад: 1.Управління комунікаціями проекту 2.Управління міжнародними проектами та програмами');
        break;
    case 3:
        console.log('Середа, розклад: 1.Проектне бюджетування та фінансове планування 2.Закупівлі і контракти в проектах');
        break;
    case 4:
        console.log('Четвер, розклад: 1.Закупівлі і контракти в проектах 2.Фінансова грамотність');
        break;
    case 5:
        console.log('Пятниця, розклад: 1.Фінансова грамотність 2.Управління комунікаціями проекту');
        break;
    case 6:
        console.log('Вихідний (* ^ ω ^)');
        break;
    case 7:
        console.log('Вихідний (* ^ ω ^)');
        break;
    default:
        console.log('Неправильно введені дані');
}

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

let year = +prompt('Введіть рік')
if (Number.isInteger(year / 4)){
    console.log('Високосний рік');
} else {
    console.log('Не високосний рік');
}